artillery/scenarios/dev-tools.yml
# Dev Tools Load Test Scenario
# Tests the dev tools endpoint under various load conditions

config:
  target: 'http://localhost:3000'
  phases:
    # Light load test
    - duration: 30
      arrivalRate: 5
      name: 'Light load'

    # Medium load test
    - duration: 60
      arrivalRate: 15
      name: 'Medium load'

    # Heavy load test
    - duration: 90
      arrivalRate: 25
      name: 'Heavy load'

  plugins: {}

scenarios:
  - name: 'Dev Tools API Test'
    weight: 100
    flow:
      - get:
          url: '/v1/dev-tools'
          expect:
            - statusCode: 200
            - contentType: 'text/html'
            - contains: 'Dev Tools'
      - think: 3
      - get:
          url: '/v1/dev-tools'
          expect:
            - statusCode: 200
            - contains: 'System Health'
      - think: 2